# **Отчет по лабораторной работе № 8 по курсу “Фундаментальная информатика”**

**Студент группы:** М8О-108Б-22 Калюжный Михаил Сергеевич, номер по списку 11

**Контакты e-mail:** <pifagerodot@gmail.com>

**Работа выполнена:** «15» ноября 2022 г.

**Преподаватель:** асп. каф. 806 Сахарин Никита Александрович

**Входной контроль знаний с оценкой:** 

**Отчет сдан:** «19» ноября 2022 г., **итоговая оценка** 

**Подпись преподавателя:** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

1. **Тема**

Обработка последовательности литер входгошо текстового файла. Простейшие приемы лексического анализаю Диаграммы состояний и переходов.

2. **Цель работы**

Составить программу на языке Си, выпоняющую анализ и обработку вводимого текста в соответствии с выданным преподавателем вариантом задания.

3. **Задание (вариант № 35)**

ВЫделить все десятичные числа от 17 до 77 по модулю и распечатать их на французском языке

4. **Оборудование:**

Процессор: AMD Ryzen 3 3200U @2.600GHz with Radeon Vega Mobile Gfx 2.60 GHz

ОП: 8ГБ

SSD: 256 ГБ

Адрес: 159.65.63.147

Монитор: 15,6-дюймовый (1920 x 1080)

Графика: AMD Radeon(TM) Vega 3 Graphics

5. **Программное обеспечение:**

- Операционная система семейства:  UNIX
- Наименование:  Ubuntu
- Версия:  Ubuntu 22.04 LTS
- Интерпретатор команд:  bash
- Версия:  5.1-6ubuntu1
- Компилятор:  gcc

6. **Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)**

Составить программу, считывающую символы и распечатывающую нужные значения.

7. **Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]**
- Считать символы
- Выделить из них числа от 17 до 77 по модулю
- Распечатать их

Пункты 1-7 отчета составляются строго до начала лабораторной работы. Допущен к выполнению работы.

**Подпись преподавателя** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

8. **Распечатка протокола**

#include <stdio.h>

#include <stdbool.h>



int print(int d, int p)

{

	char *t, *r, *m;

	if (p == 0)

	{ 	

		m = "";

	}

	else

	{

		m = "moins ";

	}

	if (d > 16 && d < 78)

	{

		if (d / 10 == 1)

		{

			switch (d % 10)

			{

				case 7:

					printf("dix-sept\n");

					break;

				case 8:

					printf("dix-huit\n");

					break;

				case 9:

					printf("dix-neuf\n");

					break;

			}

		}

		else

		{

			if (d / 10 == 7)

			{

				switch (d % 10)

				{

					case 0:

						printf("soixante-dix\n");

						break;

					case 1:

						printf("soixante et onze\n");

						break;

					case 2:

						printf("soixante-douze\n");

						break;

					case 3:

						printf("soixante-treize\n");

						break;

					case 4:

						printf("soixante-quatorze\n");

						break;

					case 5:

						printf("soixante-quinze\n");

						break;

					case 6:

						printf("soixante-seize\n");

						break;

					case 7:

						printf("soixante-dix-sept\n");

						break;	

				}		

			}

			else

			{

				switch (d % 10)

				{

					case 0:

						t = "\n";

						break;

					case 1:

						t = " et un\n";

						break;

					case 2:

						t = "-deux\n";

						break;

					case 3:

						t = "-trois\n";

						break;

					case 4:

						t = "-quatre\n";

						break;

					case 5:

						t = "-cinq\n";

						break;

					case 6:

						t = "-six\n";

						break;

					case 7:

						t = "-sept\n";

						break;

					case 8:

						t = "-huit\n";	

						break;

					case 9:

						t = "-neuf\n";

						break;	

				}

				switch (d / 10)

				{		

					case 2:

						r = "vingt";

						break;

					case 3:

						r = "trente";

						break;

					case 4:

						r = "quarante";

						break;

					case 5:

						r = "cinquante";

						break;

					case 6:

						r = "soixante";

						break;

					}

				printf("\n");

				printf("%s", m);

				printf("%s", r);

				printf("%s", t);

			}

		}

	}

	return 1;	

}



int main()

{

	int a, b, c, d, k, p;

	bool f;

	c = getchar();

	while (1)

	{

		f = true;

		k = 1;

		d = 0;

		p = 0;

		while (f = true)

		{

			if (c-'0' == -16 || c-'0' == -38)

			{

				if (d != 0)

				{

					print(d, p);

				}

				k = 1;

				d = 0;

				p = 0;

			}

			else

			{

				a = c-'0';

				if (k == 2)

				{

					d = 0;	

				}

				else	

				{	

					if (d > 0 && (c != ' ' || c != '\n'))

					{	

						f = false;

					}

					else

					{	

						if (k == 1)

						{

							if (a == -3)

							{

								k = 1;

								p = 1;

							}

							else

							{

								b = a*10;

								k = 0;

							}

						}

						else

						{

							d = b + a;

							k = 2;

						}

					}

				}

			}

			c = getchar();

			if (c == EOF)

			{

				print(d, p);	

				f = false;

				return 2;

				break;					

			}

		}

	}

	return 0;

}

9. **Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.**

|№|Лаб. или дом.|Дата|Время|Событие|Действие по исправлению|Примечания|
| :-: | :-: | :-: | :-: | :-: | :-: | :-: |
|1|Дом.|15.11.2022|5:00|Выполнение лабораторной работы|-|-|

10. **Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX**

Данное задание удобно выполнять через getchar()

11. **Выводы**

Было выполнено поставленное задание, изучены основы работы с циклами, посимвольным считыванием и аользовательскими функциями.

Недочёты при выполнении задания могут быть устранены следующим образом: —

**Подпись студента:** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

