# **Отчет по лабораторной работе № 8 по курсу “Фундаментальная информатика”**

**Студент группы:** М8О-108Б-22 Калюжный Михаил Сергеевич, номер по списку 11

**Контакты e-mail:** <pifagerodot@gmail.com>

**Работа выполнена:** «20» декабря 2022 г.

**Преподаватель:** асп. каф. 806 Сахарин Никита Александрович

**Входной контроль знаний с оценкой:** 

**Отчет сдан:** «21» декабря 2022 г., **итоговая оценка** 

**Подпись преподавателя:** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

## 1. **Тема**

Обработка матриц.

## 2. **Цель работы**

Составить программу на языке Си, производящую обработку квадратной матрицы небольшого порядка из целых чисел, вводимой из стандартного входного текстового файла.

## 3. **Задание (вариант № 11)**

Циклический сдвиг матрицы по спирали по часовой стрелке на n элементов.

## 4. **Оборудование:**

Процессор: AMD Ryzen 3 3200U @2.600GHz with Radeon Vega Mobile Gfx 2.60 GHz

ОП: 8ГБ

SSD: 256 ГБ

Адрес: 159.65.63.147

Монитор: 15,6-дюймовый (1920 x 1080)

Графика: AMD Radeon(TM) Vega 3 Graphics

## 5. **Программное обеспечение:**

- Операционная система семейства:  UNIX
- Наименование:  Ubuntu
- Версия:  Ubuntu 22.04 LTS
- Интерпретатор команд:  bash
- Версия:  5.1-6ubuntu1
- Компилятор:  gcc

## 6. **Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)**

Записать первые n элементов в одномерный массив, последующие n-1 элементов - в другой массив. Присвоить элементам этих массивов необходимые индексы.

## 7. **Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]**

- Ввод матрицы
- Обход матрицы в цикле, выводящем элементы по спирали и запись этих элементов в два одномерных массива соответственно
- Обход матрицы в цикле с присвоением элементам необходимых индексов, путем вывода индексов элементов, располагающихся по спирали
- Вывод полученной матрицы с помощью двух вложенных циклов for

``` :src/lab15.c
#include <stdio.h>

void sdvig(int s, int n,  int (*m)[n]);

int main() {
    int n, s;
    scanf("%d", &s);
    scanf("%d", &n);
    int m[n][n];
    for (int i = 0; i != n; ++i) {
   	for (int j = 0; j != n; ++j) {
            scanf("%d", &m[i][j]);
	}
    }
    sdvig(s, n, (int (*)[n]) m);
    return 0;
}

void sdvig(int s, int n,  int (*m)[n]) {
    int r[n][n];
    int dir[4] = { 1, 0, -1, 0 };
    int a[n * n - s - 1];
    int b[s - 1];
    int l = n;
    int q = 0;
    int p = 0;
    int z = 0;
    int i = 0, j = -1;
    while (l != 0) {
        for (int k = 0; k != l; k++) {
            j += dir[p % 4];
            i += dir[(p+3) % 4];
            if (q == 0) {
                a[z] = m[i][j];
                if (z == n * n - s - 1) {
                    z = -1;
                    q = 1;
                }
            }
            else {
                b[z] = m[i][j];
            }
            z++;
        }
        p++;
        l -= p % 2;
    }
    
    l = n;
    p = 0;
    q = 0;
    z = 0;
    i = 0, j = -1;
    while (l != 0) {
        for (int k = 0; k != l; k++) {
            j += dir[p % 4];
            i += dir[(p+3) % 4];
            if (q == 0) {
                r[i][j] = b[z];
                if (z == s - 1) {
                    z = -1;
                    q = 1;
                }
            }
            else {
                if (z == 0) {
                    r[i][j] = m[0][0];
                }
                else {
                    r[i][j] = a[z];
                }
            }
            z++;
        }
        p++;
        l -= p % 2;
    }

    for (int i = 0; i != n; ++i) {
   	for (int j = 0; j != n; ++j) {
            printf("%d " , r[i][j]);
	}
	printf("\n");
    }
}
```

Пункты 1-7 отчета составляются строго до начала лабораторной работы. Допущен к выполнению работы.

**Подпись преподавателя** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

## 8. **Распечатка протокола**
```
Тесты:

1)
  Ввод: 
  4
  4
   1  2  3  4
   5  6  7  8
   9 10 11 12
  13 14 15 16

  Вывод: 
   6  7 11 10
  15 14 13  1
  16  5  9  2
  12  8  4  3 

2)
  Ввод:
  3
  5
  11 12 13 14 15
  21 22 23 24 25
  31 32 33 34 35
  41 42 43 44 45
  51 52 53 54 55
  
  Вывод:
  42 32 33 11 12 
  51 41 31 21 13 
  52 44 43 22 14 
  53 34 24 23 15 
  54 55 45 35 25

3)
  Ввод:
  8
  3
  1 2 3
  4 5 6
  7 8 9
  
  Вывод: 
  2 3 6 
  5 1 9 
  4 7 8
```
## 9. **Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.**

|№|Лаб. или дом.|Дата|Время|Событие|Действие по исправлению|Примечания|
| :-: | :-: | :-: | :-: | :-: | :-: | :-: |
|1|Дом.|10.12.2022|19:00|Выполнение лабораторной работы|-|-|

## 10. **Замечания автора по существу работы**



## 11. **Выводы**

Были изучены основы работы с матрицами, получены необходимые навыки их обрааботки, применены ранее полученные в ходе выполнения 14 лабораторной работы знания, а также выполнены поставленные задачи.

Недочёты при выполнении задания могут быть устранены следующим образом: —

**Подпись студента:** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

