# **Отчет по лабораторной работе № 8 по курсу “Фундаментальная информатика”**

**Студент группы:** М8О-108Б-22 Калюжный Михаил Сергеевич, номер по списку 11

**Контакты e-mail:** <pifagerodot@gmail.com>

**Работа выполнена:** «15» ноября 2022 г.

**Преподаватель:** асп. каф. 806 Сахарин Никита Александрович

**Входной контроль знаний с оценкой:** 

**Отчет сдан:** «19» ноября 2022 г., **итоговая оценка** 

**Подпись преподавателя:** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

1. **Тема**

Техника работы с целыми числами. Системы счисления.

2. **Цель работы**

Составить программу на языке Си в целом типе данных, которая для любых чисел будет выполнять поставленную задачу.

3. **Задание (вариант № 11)**

ВЫполнить циклический сдвиг десятичного числа влево(вправо). 

4. **Оборудование:**

Процессор: AMD Ryzen 3 3200U @2.600GHz with Radeon Vega Mobile Gfx 2.60 GHz

ОП: 8ГБ

SSD: 256 ГБ

Адрес: 159.65.63.147

Монитор: 15,6-дюймовый (1920 x 1080)

Графика: AMD Radeon(TM) Vega 3 Graphics

5. **Программное обеспечение:**

Gcc

6. **Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)**

Составить программу, считывающую символы и распечатывающую нужные значения.

7. **Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]**
- Считать символы
- Выполнить циклический сдвиг
- Распечатать

Пункты 1-7 отчета составляются строго до начала лабораторной работы. Допущен к выполнению работы.

**Подпись преподавателя** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

8. **Распечатка протокола**

#include <stdio.h>
#include <math.h>

int main ()
{
	int k, a, b, r;
	char t, c;
	printf("R or L?\n");
	scanf("%c", &t);
	a = 0;
	if (t == 'L')
	{
		printf("How many symbols?\n");
		scanf("%d", &k);
		c = getchar();
		c = getchar();
		while (k != 0)
		{
			b = c-'0';
			k = k - 1;
			a = a + b * pow(10,k);
			c = getchar();
		}
		while (c != '\n')
		{
			b = c-'0';
			printf("%d", b);
			c = getchar();
		}
		printf("%d\n", a);
	}
	if (t == 'R')
	{
		printf("How many symbols?\n");
		scanf("%d", &k);
		printf("How many symbols in your number?\n");
		scanf("%d", &r);
		k = r - k;
		c = getchar();
		c = getchar();
		while (k != 0)
		{
			b = c-'0';
			k = k - 1;
			a = a + b * pow(10,k);
			c = getchar();
		}
		while (c != '\n')
		{
			b = c-'0';
			printf("%d", b);
			c = getchar();
		}
		printf("%d\n", a);
	}
	return 0;
}

9. **Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.**

|№|Лаб. или дом.|Дата|Время|Событие|Действие по исправлению|Примечания|
| :-: | :-: | :-: | :-: | :-: | :-: | :-: |
|1|Дом.|15.11.2022|5:00|Выполнение лабораторной работы|-|-|

10. **Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX**

Данное задание удобно выполнять через getchar()

11. **Выводы**

Было выполнено поставленное задание, изучены основы работы с циклами, посимвольным считыванием, целыми числами, системами счисления и пользовательскими функциями.

Недочёты при выполнении задания могут быть устранены следующим образом: —

**Подпись студента:** \_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_\_

